//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2023, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************

/** 
 * @file Crb.uni
 * Chipset Reference Board setup string definitions
 */

/=#
#include "VFR.uni"
#include "SB.uni"
#include "ACPI.uni"

#ifndef x-AMI
#langdef   x-AMI "x-AMI"    // AMI Configuration Language
#endif

#string STR_CRB_FORM                    #language eng "CRB Board"
#string STR_CRB_FORM                    #language fra "fra CRB Board"
#string STR_CRB_FORM_HELP               #language eng "CRB Board Parameters"
#string STR_CRB_FORM_HELP               #language fra "fra CRB Board Parameters"
#string STR_PORT_FORM                   #language eng "PCI-E Port"
#string STR_PORT_FORM_HELP              #language eng "PCI-E Port Parameters"

//---------------------------------------------------------------------------
//Board Device Option
//---------------------------------------------------------------------------
#string STR_HELP                            #language eng ""
#string STR_ENABLE                          #language eng "Enabled"
#string STR_DISABLE                         #language eng "Disabled"
#string STR_ONBOARD_LAN_PXE_PROMPT          #language eng "Onboard PCIE LAN PXE ROM"
                                            #language x-AMI "CRB001"
#string STR_ONBOARD_LAN_PXE_PROMPT_HELP     #language eng "The Onboard PCIE LAN PXE ROM "

#string STR_ONBOARD_LAN_PROMPT              #language eng "Onboard PCIE LAN"
#string STR_ONBOARD_LAN_PROMPT_HELP         #language eng "Onboard PCIE LAN"
#string STR_POWERDOWN                       #language eng "Power Down"

#string STR_SBGPPHIDEPORT_PROMPT            #language eng "Hide Unused GPP Ports"
#string STR_SBGPPENABLE_PROMPT              #language eng "SB GPP Function"
#string STR_SATA_MAXGEN2_CAP_STRING         #language eng "SATA MAXGEN2 CAP OPTION"

#string STR_NB_GPP_CORE_CONFIG              #language eng   "NB GPP Core Config"
#string STR_NB_GPP_CORE_CONFIG_HELP         #language eng   "NB GPP Core Configuration"
#string STR_GPP_CORE_X4X4                   #language eng   "GPP_CORE_x4x4"
#string STR_GPP_CORE_X4X2X2                 #language eng   "GPP_CORE_x4x2x2"
#string STR_GPP_CORE_X4X2X1X1               #language eng   "GPP_CORE_x4x2x1x1"
#string STR_GPP_CORE_X4X1X1X1X1             #language eng   "GPP_CORE_x4x1x1x1x1"

#string STR_D2F2_ENABLED                    #language eng   " Dev2 Fun2 "
                                            #language x-AMI "CRB003"
#string STR_D2F2_ENABLED_HELP               #language eng   "Dev2 Fun2 Enabled/Disabled"

#string STR_D2F3_ENABLED                    #language eng   " Dev2 Fun3 "
                                            #language x-AMI "CRB004"
#string STR_D2F3_ENABLED_HELP               #language eng   "Dev2 Fun3 Enabled/Disabled"

#string STR_D2F4_ENABLED                    #language eng   " Dev2 Fun4 "
                                            #language x-AMI "CRB005"
#string STR_D2F4_ENABLED_HELP               #language eng   "Dev2 Fun4 Enabled/Disabled"

#string STR_D3F1_ENABLED                    #language eng   " Dev3 Fun1 "
                                            #language x-AMI "CRB006"
#string STR_D3F1_ENABLED_HELP               #language eng   "Dev3 Fun1 Enabled/Disabled"

#string STR_NB_ROOT_PORT_ASPM_MODE          #language eng   "  ASPM Mode Control"
                                            #language x-AMI "CRB007"
#string STR_NB_ROOT_PORT_ASPM_MODE_HELP     #language eng   "NB Root Port ASPM Mode Control"
#string STR_ASPM_L0S                        #language eng   "L0s Entry"
#string STR_ASPM_L1                         #language eng   "L1 Entry"
#string STR_ASPM_L0S_L1                     #language eng   "L0s And L1 Entry"

#string STR_NB_ROOT_PORT_HOTPLUG_MODE       #language eng   "  Hotplug Mode Control"
                                            #language x-AMI "CRB008"
#string STR_NB_ROOT_PORT_HOTPLUG_MODE_HELP  #language eng   "NB Root Port Hotplug Mode Control"
#string STR_HOTPLUG_BASIC                   #language eng   "Hotplug Basic"
#string STR_HOTPLUG_SERVER                  #language eng   "Hotplug Server"
#string STR_HOTPLUG_ENHANCED                #language eng   "Hotplug Enhanced"
#string STR_HOTPLUG_INBOARD                 #language eng   "Hotplug Inboard"

#string STR_NB_ROOT_PORT_LINK_SPEED         #language eng   "  Link Speed"
                                            #language x-AMI "CRB009"

#string STR_NB_ROOT_PORT_LINK_SPEED_HELP    #language eng   "NB Root Port Pcie Link Speed, The Link Speed May Overwritten By Pspp Settings"
#string STR_MAX_SPEED                       #language eng   "Max Speed"
#string STR_PCIE_GEN1                       #language eng   "Pcie Gen1"
#string STR_PCIE_GEN2                       #language eng   "Pcie Gen2"

#string STR_PSPP_POLICY_STRING              #language eng   "PSPP Policy"
#string STR_PSPP_POLICY_HELP                #language eng   "PCIe Speed Power Policy"
#string STR_PERFORMANCE_STRING              #language eng   "Performance"
#string STR_BALANCED_HIGH_STRING            #language eng   "Balanced-High"
#string STR_BALANCED_LOW_STRING             #language eng   "Balanced-Low"
#string STR_POWER_SAVING_STRING             #language eng   "Power Saving"

#string STR_D2F5_ENABLED                    #language eng   " Dev2 Fun5"
#string STR_D2F5_ENABLED_HELP               #language eng   "Dev2 Fun5 Enabled/Disabled"

#string STR_CRB_AMD_PCIE_CONTROL            #language eng   " Pcie Port Control"
#string STR_CRB_AMD_PCIE_CONTROL_HELP       #language eng   "Disabled: Skip this page setup item, and use the default CRB setting"

#string STR_CRB_ONBOARD_TPM_PROMPT          #language eng   "AMD CRB onboard TPM control"
                                            #language x-AMI "CRB011"
#string STR_CRB_ONBOARD_TPM_PROMPT_HELP     #language eng   "To select. 0 - OffBoard LPC TPM.   1 - OnBoard SPI TPM"
#string STR_CRB_LPC_TPM                     #language eng   "OffBoard LPC TPM"
#string STR_CRB_SPI_TPM                     #language eng   "OnBoard SPI TPM"

#string STR_CRB_WHCK_EHCI_DEBUG_PORT_PROMPT #language eng   "AMD CRB EHCI Debug port switch"
                                            #language x-AMI "CRB012"
#string STR_CRB_WHCK_EHCI_DEBUG_PORT_PROMPT_HELP    #language eng   "To select. 0 - disable debug port.   1 - enable EHCI debug port for WHCK - Debug Capability Test"
                                                    #language x-AMI "CRB013"
#string STR_CRB_SD_CONNECTOR_PROMPT                 #language eng   "AMD CRB SD Connector"
#string STR_CRB_SD_CONNECTOR_PROMPT_HELP            #language eng   "If selectFCH-SD, M2 connector disabled."
#string STR_CRB_FCH_SD                              #language eng   "FCH-SD"
#string STR_CRB_REALTEK_SD                          #language eng   "Realtek chip-SD"

#string STR_PCIE_LINK_COMPLIANCE_MODE_PROMPT        #language eng "PCIe Compliance Mode"
                                                    #language x-AMI "CRB014"
#string STR_PCIE_LINK_COMPLIANCE_MODE_PROMPT_HELP   #language eng "PCIe Link Compliance Mode."
#string STR_PCIE_LINK_COMPLIANCE_MODE_ENABLED       #language eng "On"
#string STR_PCIE_LINK_COMPLIANCE_MODE_DISABLED      #language eng "Off"

#string STR_ONBOARD_EXTERNAL_VGA                    #language eng "OnBrd/Ext VGA Select"
                                                    #language x-AMI "CRB016"
#string STR_ONBOARD_EXTERNAL_VGA_HELP               #language eng "Select between onboard or external VGA support."
#string STR_AUTO_VGA_TEXT                           #language eng "Auto"
#string STR_ONBOARD_VGA_TEXT                        #language eng "Onboard"
#string STR_EXTERNAL_VGA_TEXT                       #language eng "External"

#string STR_VGA_SLOT_VALUE                          #language eng "VGA Slot"
                                                    #language x-AMI "CRB017"
#string STR_VGA_SLOT_VALUE_HELP                     #language eng "For external VGA, select VGA on which slot to be enabled."

#string AMD_CBS_STR_CBS_ROOT_SECTION                 #language en-US    "AMD CBS"
#string AMD_CBS_STR_CBS_ROOT_SECTION_HELP            #language en-US    "AMD CBS Setup Page"

//#string <string name>                   #language eng ""
